INSERT INTO author(first_name, last_name, birth_date) VALUES
('Федор', 'Достоевский', '1821-11-18'),
('Харуки', 'Мураками', '1949-01-12'),
('Татьяна', 'Устинова', '1968-04-21'),
('Борис', 'Стругацкий', '1933-04-15'),
('Стивен', 'Кинг', '1947-09-21');


INSERT INTO book(book_title, description, author_id, available_copies) VALUES
('Игрок', '', 1, 10),
('Преступление и наказание', 'Преступление и наказание» — высочайший образец криминального романа.', 1, 15),
('Братья Карамазовы', '"Братья Карамазовы" (1880 г.) — последний роман Достоевского, вершина его творчества, в каком-то смысле главный труд всей его жизни и одно из величайших произведений в истории мировой литературы.', 1, 7),
('Норвежский лес', 'Роман «Норвежский лес» принес автору поистине всемирную известность. Тонкие психологические нюансы, музыка, наполняющая страницы, эротизм — все это есть в романе, от которого невозможно оторваться. Фильм по мотивам бестселлера участвовал в основном конкурсе 67-го Венецианского кинофестиваля!', 2, 12),
('Кафка на пляже', '', 2, 8),
('Слушай песню ветра. Пинбол 1973', '', 2, 5),
('Судьба по книге перемен', 'Маня Поливанова, она же известная писательница Марина Покровская, вынуждена помогать своей тете Эмилии, и это просто мука мученическая, потому что Эмилия – знаменитый экстрасенс, а Маня ни в какое ясновидение и колдовство решительно не верит!', 3, 4),
('Неразрезанные страницы', 'Писатель Алекс Шан-Гирей решает, что должен снова вернуть себя и обрести свободу. И потому расстается с Маней Поливановой — женщиной всей своей жизни, а по совместительству автором популярных детективов… А Маня совершенно не выносит вранья и человеческих мучений.', 3, 8),
('Пять шагов по облакам', '', 3, 7),
('Жук в муравейнике', 'После миссии Максима Каммерера на планете Саракш прошло 20 лет. Теперь он работает на Земле, в КОМКОНе-2. Его очередное задание — разыскать прогрессора Льва Абалкина, самовольно покинувшего Саракш, но проигнорировавшего требование зарегистрироваться на Земле. Встречи Каммерера со знакомыми Абалкина вскрывают тайну, способную нанести серьезный вред не только окружающим его людям, но и, возможно, всему человечеству...', 4, 8),
('Обитаемый остров', '', 4, 12),
('Пикник на обочине', '', 4, 4),
('Куджо', 'Один из обитателей тихого провинциального городка Касл-Рок — добродушный сенбернар Куджо. Однажды преследуя кролика, он загоняет его в маленькую пещеру, где получает укус летучей мыши.', 5, 3),
('Оно', 'В маленьком провинциальном городке Дерри много лет назад семерым подросткам пришлось столкнуться с кромешным ужасом - живым воплощением ада.', 5, 6),
('Сияние', '…Проходят годы, десятилетия, но потрясающая история писателя Джека Торранса, его сынишки Дэнни, наделенного необычным даром, и поединка с темными силами, обитающими в роскошном отеле "Оверлук", по-прежнему завораживает и держит в неослабевающем напряжении читателей самого разного возраста…', 5, 7);


INSERT INTO borrow(book_id, reader_name, issue_date, return_date) VALUES
(3, 'Иван', '2024-09-16', '2024-09-30'),
(12, 'Наталия', '2024-12-1', '2024-12-17'),
(12, 'Петя', '2024-11-29', '2024-12-13');
